Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.107/BZ24/include/pic32cx1012bz24032.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M4 handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnRTC_Handler;                          /*   0 Real-Time Counter (RTC) */
  void* pfnEIC_Handler;                          /*   1 External Interrupt Controller (EIC) */
  void* pfnFREQM_Handler;                        /*   2 Frequency Meter (FREQM) */
  void* pfnFLASH_CONTROL_Handler;                /*   3 flash controller (NVM) */
  void* pfnCHANGE_NOTICE_A_Handler;              /*   4 GPIO (GPIOA) */
  void* pfnCHANGE_NOTICE_B_Handler;              /*   5 GPIO (GPIOB) */
  void* pfnDMAC_0_3_Handler;                     /*   6 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_4_15_Handler;                    /*   7 Direct Memory Access Controller (DMAC) */
  void* pfnEVSYS_0_3_Handler;                    /*   8 Event System Interface (EVSYS) */
  void* pfnEVSYS_4_11_Handler;                   /*   9 Event System Interface (EVSYS) */
  void* pfnPAC_Handler;                          /*  10 Peripheral Access Controller (PAC) */
  void* pfnRAMECC_Handler;                       /*  11 RAM ECC (RAMECC) */
  void* pfnSERCOM0_Handler;                      /*  12 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_Handler;                      /*  13 Serial Communication Interface (SERCOM1) */
  void* pvReserved14;
  void* pvReserved15;
  void* pfnTCC0_Handler;                         /*  16 Timer Counter Control (TCC0) */
  void* pfnTCC1_Handler;                         /*  17 Timer Counter Control (TCC1) */
  void* pfnTCC2_Handler;                         /*  18 Timer Counter Control (TCC2) */
  void* pfnTC0_Handler;                          /*  19 Basic Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /*  20 Basic Timer Counter (TC1) */
  void* pfnTC2_Handler;                          /*  21 Basic Timer Counter (TC2) */
  void* pfnTC3_Handler;                          /*  22 Basic Timer Counter (TC3) */
  void* pfnADCHS_Handler;                        /*  23 12-bit Analog to Digital Converter (ADCHS) */
  void* pvReserved24;
  void* pfnAES_Handler;                          /*  25 Advanced Encryption Standard (AES) */
  void* pfnTRNG_Handler;                         /*  26 True Random Generator (TRNG) */
  void* pfnICM_Handler;                          /*  27 Integrity Check Monitor (ICM) */
  void* pfnPUKCC_Handler;                        /*  28 PUblic-Key Cryptography Controller (PUKCC) */
  void* pfnQSPI_Handler;                         /*  29 Quad SPI interface (QSPI) */
  void* pfnZB_INT0_Handler;                      /*  30 ZIGBEE Radio Registers (ZIGBEE) */
  void* pfnBT_INT0_Handler;                      /*  31 BLE (BLE) */
  void* pfnBT_INT1_Handler;                      /*  32 BLE (BLE) */
  void* pfnARBITER_Handler;                      /*  33 Radio Arbiter (ARB) */
  void* pfnADC_FAULT_Handler;                    /*  34 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnADC_EOS_Handler;                      /*  35 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnADC_BGVR_RDY_Handler;                 /*  36 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnCLKI_WAKEUP_NMI_Handler;              /*  37 BLE (BLE) */
  void* pfnBT_LC_Handler;                        /*  38 BLE (BLE) */
  void* pfnBT_RC_Handler;                        /*  39 BLE (BLE) */
} DeviceVectors;

#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if !defined DONT_USE_PREDEFINED_CORE_HANDLERS
/* CORTEX-M4 exception handlers */
void Reset_Handler                 ( void );
void NonMaskableInt_Handler        ( void );
void HardFault_Handler             ( void );
void MemoryManagement_Handler      ( void );
void BusFault_Handler              ( void );
void UsageFault_Handler            ( void );
void SVCall_Handler                ( void );
void DebugMonitor_Handler          ( void );
void PendSV_Handler                ( void );
void SysTick_Handler               ( void );
#endif /* DONT_USE_PREDEFINED_CORE_HANDLERS */

#if !defined DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS
/* Peripherals interrupt handlers */
void RTC_Handler                   ( void );
void EIC_Handler                   ( void );
void FREQM_Handler                 ( void );
void FLASH_CONTROL_Handler         ( void );
void CHANGE_NOTICE_A_Handler       ( void );
void CHANGE_NOTICE_B_Handler       ( void );
void DMAC_0_3_Handler              ( void );
void DMAC_4_15_Handler             ( void );
void EVSYS_0_3_Handler             ( void );
void EVSYS_4_11_Handler            ( void );
void PAC_Handler                   ( void );
void RAMECC_Handler                ( void );
void SERCOM0_Handler               ( void );
void SERCOM1_Handler               ( void );
void TCC0_Handler                  ( void );
void TCC1_Handler                  ( void );
void TCC2_Handler                  ( void );
void TC0_Handler                   ( void );
void TC1_Handler                   ( void );
void TC2_Handler                   ( void );
void TC3_Handler                   ( void );
void ADCHS_Handler                 ( void );
void AES_Handler                   ( void );
void TRNG_Handler                  ( void );
void ICM_Handler                   ( void );
void PUKCC_Handler                 ( void );
void QSPI_Handler                  ( void );
void ZB_INT0_Handler               ( void );
void BT_INT0_Handler               ( void );
void BT_INT1_Handler               ( void );
void ARBITER_Handler               ( void );
void ADC_FAULT_Handler             ( void );
void ADC_EOS_Handler               ( void );
void ADC_BGVR_RDY_Handler          ( void );
void CLKI_WAKEUP_NMI_Handler       ( void );
void BT_LC_Handler                 ( void );
void BT_RC_Handler                 ( void );
#endif /* DONT_USE_PREDEFINED_PERIPHERALS_HANDLERS */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

/* Configuration of the CORTEX-M4 Processor and Core Peripherals */
#define __CM4_REV                     0x0001
#define __DEBUG_LVL                        3
#define __FPU_PRESENT                      1
#define __MPU_PRESENT                      1
#define __NVIC_PRIO_BITS                   3
#define __TRACE_LVL                        2
#define __VTOR_PRESENT                     1
#define __Vendor_SysTickConfig             0
#define __ARCH_ARM                         1 /* ARM architecture or not                                                   */

